anishshriram/esp32-csi-sensor/firmware/sdkconfig.defaults.rx
# esp-csi csi_recv (RECEIVER) -- Kconfig-level settings, Phase 1.
# Merged into the example's own sdkconfig.defaults by scripts/build_firmware.sh.
# Channel and bandwidth are NOT here -- they come from firmware/patches/.

CONFIG_IDF_TARGET="esp32"

# serial
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESPTOOLPY_MONITOR_BAUD=921600

# CSI + WiFi RX headroom so the 100 Hz stream does not stall
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=128
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# performance
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_FREERTOS_HZ=1000
